In [1]:
import pandas as pd

# Creación de DataFrame

In [2]:
#Crea un DataFrame llamado ventas con las siguientes columnas: "Producto", "Cantidad", "PrecioUnitario".
#Ingresa al menos 5 filas de datos

ventas = {"Producto":["Arroz","Fideos","Polenta","Cereales","Harina"],
         "Cantidad":[22,12,33,55,22],
         "Precio Unitario":[1.22,3.44,11.11,22,32.34]}

df = pd.DataFrame(ventas)

df

   Producto  Cantidad  Precio Unitario
0     Arroz        22             1.22
1    Fideos        12             3.44
2   Polenta        33            11.11
3  Cereales        55            22.00
4    Harina        22            32.34

# Operaciones Básicas

In [3]:
#Calcula la suma total de la columna "Cantidad" en el DataFrame ventas.



suma = df["Cantidad"].sum()

suma

144

In [4]:
#Encuentra el producto con el precio unitario más alto.

precio_unitario = df["Precio Unitario"].max()

precio_unitario

32.34

# Limpieza de Datos

In [5]:
#Verifica si hay valores nulos en el DataFrame ventas.

hay_nulos = df.isnull()

hay_nulos

   Producto  Cantidad  Precio Unitario
0     False     False            False
1     False     False            False
2     False     False            False
3     False     False            False
4     False     False            False

In [7]:
#Elimina las filas que tienen valores nulos en alguna columna.

df_sin_nulos = df.dropna()

df

   Producto  Cantidad  Precio Unitario
0     Arroz        22             1.22
1    Fideos        12             3.44
2   Polenta        33            11.11
3  Cereales        55            22.00
4    Harina        22            32.34

# Operadores Lógicos

In [9]:
#Filtra las filas en las que la cantidad de productos vendidos sea mayor a 10 y el precio unitario sea menor a 50.

filtro = (df["Cantidad"] > 10) & (df["Precio Unitario"] < 50)

df[filtro]

   Producto  Cantidad  Precio Unitario
0     Arroz        22             1.22
1    Fideos        12             3.44
2   Polenta        33            11.11
3  Cereales        55            22.00
4    Harina        22            32.34

# Selección

In [10]:
## Selecciona las primeras 3 filas del DataFrame ventas.

ventas = df.head(3)

ventas

  Producto  Cantidad  Precio Unitario
0    Arroz        22             1.22
1   Fideos        12             3.44
2  Polenta        33            11.11

In [11]:
#Selecciona la columna "Producto" utilizando notación de corchetes.

columna_producto = df["Producto"]

columna_producto

0       Arroz
1      Fideos
2     Polenta
3    Cereales
4      Harina
Name: Producto, dtype: object